Revit 2027 API
Space.ReturnAirflow Property
Get or set the Return type of Supply Airflow of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ReturnAirflowType ReturnAirflow { get; set; }
Public Property ReturnAirflow As ReturnAirflowType
	Get
	Set
public:
property ReturnAirflowType ReturnAirflow {
	ReturnAirflowType get ();
	void set (ReturnAirflowType value);
}
member ReturnAirflow : ReturnAirflowType with get, set
Property Value
ReturnAirflowType
Remarks
This property is used to get or set the Return type of Supply Airflow of the Space.
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace